[
    {
        "company": "True Anomaly Space",
        "link": "https://trueanomaly.space",
        "position": "Flight Software Engineer",
        "duration": "2025-current",
        "type": "Full-time",
        "description": [],
        "logo": "../assets/logos/ta.jpeg"
    },
    {
        "company": "Idaho National Laboratory",
        "link": "https://inl.gov",
        "position": "Software Engineer",
        "duration": "Summer 2024",
        "type": "Internship",
        "description": [
            "Designed and developed full-stack mark-in-use feature with sample history, validation logic, and approval pipeline to meet regulatory standards for nuclear materials storage using Ruby on Rails, TypeScript, RxJS, and Angular",
            "Fixed bugs, wrote test docs, participated in code reviews, led SCRUM ceremonies and learned from industry experts about software engineering processes for nuclear facilities"
        ],
        "logo": "../assets/logos/inl.jfif"
    },
    {
        "company": "University of Texas Rio Grande Valley",
        "link": "https://www.utrgv.edu",
        "position": "Computational Theory Researcher",
        "duration": "2022-2025",
        "type": "Volunteer & Paid",
        "description": [
            "Developed a performance-focused, C++ simulator enabling large-scale Tile Automata systems",
            "Co-authored and edited conference papers, contributing to the advancement of research in theory of computation"
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "Texas Christian University",
        "link": "https://www.tcu.edu",
        "position": "Bioinformatics Researcher",
        "duration": "2019-2023",
        "type": "Volunteer",
        "description": [
            "Brought iteration time from months to days via C++ and CUDA simulator, achieving a 7,000 times speedup compared to the legacy Python model",
            "Published research on viral spread during the COVID-19 pandemic, increasing accuracy of models and providing valuable insights into viral dynamics",
            "Created Python tools using numpy and matplotlib to statistically analyze terabytes of simulation data.",
            "Presented research findings at the 2021 SIAM Conference on Computational Science and Engineering, presented by invitation to the NSF Inaugural Equity in Engineering Summit."
        ],
        "logo": "../assets/logos/tcu.jfif"
    },
    {
        "company": "University of Texas Rio Grande Valley",
        "link": "https://www.utrgv.edu",
        "position": "Software Engineer",
        "duration": "2022-2024",
        "type": "Contract",
        "description": [
            "Pitched project idea to faculty and then developed a website that saved hundreds of man-hours each week",
            "Streamlined faculty and student workflows by automating report generation for a learning target-based grading system with Express, EJS, and MongoDB.",
            "Managed full project lifecycle including requirements gathering, design, development, installation, and testing"
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "General Motors Financial",
        "link": "https://www.gmfinancial.com",
        "position": "Software Engineer",
        "duration": "Summer 2023",
        "type": "Internship",
        "description": [
            "Developed features for credit inquiry application according to architect specifications using .NET, SQL, HTML & CSS within an AGILE development environment",
            "Automated daily financial reports using .NET and SQL, eliminating tedious manual work for a team member"
        ],
        "logo": "../assets/logos/gmf.jfif"
    },
    {
        "company": "Various Clients",
        "link": "",
        "position": "Full Stack Web Developer",
        "duration": "2022-2025",
        "type": "Paid",
        "description": [
            "Built custom web applications to meet specific customer requirements, focusing on responsive design and optimal user experience. Demonstrated ability to deliver complete solutions from concept to deployment."
        ],
        "logo": ""
    }
]
