[
    {
        "company": "Idaho National Laboratory",
        "link": "https://inl.gov",
        "position": "Nuclear Software Engineer",
        "duration": "Summer 2024",
        "type": "Internship",
        "description": [
            "Implemented complex features, fixed bugs, participated in beta testing, customer support and the application release cycle to track nuclear materials.",
            "Employed Ruby on Rails and Typescript with Angular in a split architecture application.",
        ],
        "logo": "../assets/logos/inl.jfif"
    },
    {
        "company": "UT Rio Grande Valley",
        "link": "https://www.utrgv.edu",
        "position": "Software Engineer",
        "duration": "2022-2024",
        "type": "Contract",
        "description": [
            "Designed and developed an application to streamline grading system for professors and students saving hundreds of hours each week by automating reports. Chose JavaScript and MongoDB for their large developer base and future maintainability.",
            "Responsible for application requirements, design, development, installation and testing.",
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "General Motors Financial",
        "link": "https://www.gmfinancial.com",
        "position": "Software Engineer",
        "duration": "Summer 2023",
        "type": "Internship",
        "description": [
            "Gathered requirements for reporting system to automate manual processes. ",
            "Developed features for credit inquiry application front end and back end using .NET and SQL."
        ],
        "logo": "../assets/logos/gmf.jfif"
    },
    {
        "company": "UT Rio Grande Valley",
        "link": "https://www.utrgv.edu",
        "position": "Research Assistant",
        "duration": "2022-2024",
        "type": "Volunteer",
        "description": [
            "Developing a performance focused, C++ and Vulkan GPGPU simulator.",
            "Researched computability in Tile Automata (TA) and Chemical Reaction Networks (CRNs).",
            "Edited and published research articles and posters; presented at symposia and conferences."
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "Texas Christian University",
        "link": "https://www.tcu.edu",
        "position": "Research Apprentice",
        "duration": "2019-2023",
        "type": "Volunteer",
        "description": [
            "Part of a team that developed a massively parallel C++ and Nvidia Cuda simulation, achieving a 7,000 times speedup compared to the legacy python model.",
            "Published findings as first author in the peer-reviewed Journal of Theoretical Biology.",
            "Created Python tools using numpy and matplotlib to statistically analyze terabytes of simulation data.",
            "Presented research findings at the 2021 SIAM Conference on Computational Science and Engineering, presented by invitation to the NSF Inaugural Equity in Engineering Summit."
        ],
        "logo": "../assets/logos/tcu.jfif"
    },
    {
        "company": "Various Clients",
        "link": "",
        "position": "Full Stack Web Developer",
        "duration": "Summer 2022",
        "type": "Paid",
        "description": [
            "Built custom web applications to meet specific customer requirements, focusing on responsive design and optimal user experience. Demonstrated ability to deliver complete solutions from concept to deployment."
        ],
        "logo": ""
    }
]
