[
    {
        "company": "Idaho National Laboratory",
        "link": "https://inl.gov",
        "position": "Nuclear Software Engineer",
        "duration": "Summer 2024",
        "type": "Internship",
        "description": [
            "Developed safety-critical software in support of nuclear energy research at the Materials and Fuels Complex.",
            "Used Ruby on Rails and Typescript with Angular in a split architecture web application.",
            "Built complex features, fixed bugs, participated in beta testing, customer support and the application release cycle."
        ],
        "logo": "../assets/logos/inl.jfif"
    },
    {
        "company": "UTRGV",
        "link": "https://www.utrgv.edu",
        "position": "Software Engineer",
        "duration": "2022-2024",
        "type": "Contract",
        "description": [
            "Architect and developer of an application designed to enhance progress reporting.",
            "Tailored to accommodate a unique learning target-based grading system.",
            "Used JavaScript, MongoDB, Linux and software engineering practices.",
            "Streamlined experience for both professors and students, saving dozens of hours each week."
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "General Motors Financial",
        "link": "https://www.gmfinancial.com",
        "position": "Software Engineer",
        "duration": "Summer 2023",
        "type": "Internship",
        "description": [
            "Contributed to the development of innovative solutions for General Motors Financial.",
            "Focused on the creation of internal credit inquiry applications.",
            "Developed new reporting processes using C# and SQL.",
            "Demonstrated leadership within my team by facilitating daily SCRUM standups and ceremonies."
        ],
        "logo": "../assets/logos/gmf.jfif"
    },
    {
        "company": "UTRGV",
        "link": "https://www.utrgv.edu",
        "position": "Research Assistant",
        "duration": "2022-2024",
        "type": "Volunteer",
        "description": [
            "Dedicated research efforts to the Algorithmic Self-Assembly Research (ASARG) Lab.",
            "Participating in research on Tile Automata (TA) and Chemical Reaction Network models (CRNs).",
            "Investigating problems in the theory of computer science, computability and software modeling.",
            "Given responsibility as the primary maintainer of the software for our TA model using Python."
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "TCU",
        "link": "https://www.tcu.edu",
        "position": "Research Apprentice",
        "duration": "2019-2023",
        "type": "Volunteer",
        "description": [
            "Engaged in the development of C++/Cuda models to simulate the spread of the Influenza virus within cellular tissue.",
            "Used Python, numpy and matplotlib to process and analyze large amounts of simulation data.",
            "Presented research findings at the 2021 SIAM Conference on Computational Science and Engineering, by invitation to the NSF Inaugural Equity in Engineering Summit.",
            "Published findings in the peer-reviewed Journal of Theoretical Biology as first author."
        ],
        "logo": "../assets/logos/tcu.jfif"
    },
    {
        "company": "Various Clients",
        "link": "",
        "position": "Full Stack Web Developer",
        "duration": "Summer 2022",
        "type": "Paid",
        "description": [
            "Web development and design for various clients, utilizing MongoDB, Express, Node.JS, and Bootstrap.",
            "Back-end development, API and database configuration and front-end design."
        ],
        "logo": ""
    }
]