[
    {
        "company": "Idaho National Laboratory",
        "link": "https://inl.gov",
        "position": "Nuclear Software Engineer",
        "duration": "Summer 2024",
        "type": "Internship",
        "description": [
            "Developed safety-critical software to track nuclear materials supporting nuclear energy research.",
            "Built complex features, fixed bugs, participated in beta testing, customer support and the application release cycle.",
            "Employed Ruby on Rails and Typescript with Angular in a split architecture web application."
        ],
        "logo": "../assets/logos/inl.jfif"
    },
    {
        "company": "UT Rio Grande Valley",
        "link": "https://www.utrgv.edu",
        "position": "Software Engineer",
        "duration": "2022-2024",
        "type": "Contract",
        "description": [
            "Architected and developed application designed to enhance progress reports for a unique target-based grading system.",
            "Streamlined experience for both professors and students, saving hundreds of hours each week spent calculating reports manually.",
            "Used JavaScript, MongoDB, Linux and software engineering practices.",
            "Responsible for application architecture, design, development, server operation and testing."
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "General Motors Financial",
        "link": "https://www.gmfinancial.com",
        "position": "Software Engineer",
        "duration": "Summer 2023",
        "type": "Internship",
        "description": [
            "Developed new reporting system using .NET and SQL automating daily manual processes.",
            "Built features for credit inquiry application front and back ends using .NET, HTML and CSS.",
            "Demonstrated leadership within team by facilitating daily SCRUM standups and ceremonies."
        ],
        "logo": "../assets/logos/gmf.jfif"
    },
    {
        "company": "UT Rio Grande Valley",
        "link": "https://www.utrgv.edu",
        "position": "Research Assistant",
        "duration": "2022-2024",
        "type": "Volunteer",
        "description": [
            "Developed high performance C++ simulator for self-building fractals in Tile Automata.",
            "Researched computability in Tile Automata (TA) and Chemical Reaction Networks (CRNs).",
            "Edited and published research articles and posters; presented at symposia and conferences."
        ],
        "logo": "../assets/logos/utrgv.jfif"
    },
    {
        "company": "Texas Christian University",
        "link": "https://www.tcu.edu",
        "position": "Research Apprentice",
        "duration": "2019-2023",
        "type": "Volunteer",
        "description": [
            "Developed C++ and Nvidia Cuda model to simulate the spread of Influenza within cellular tissue.",
            "Published findings as first author in the peer-reviewed Journal of Theoretical Biology.",
            "Used Python, numpy and matplotlib to process and statistically analyze simulation data.",
            "Presented research findings at the 2021 SIAM Conference on Computational Science and Engineering, presented by invitation to the NSF Inaugural Equity in Engineering Summit."
        ],
        "logo": "../assets/logos/tcu.jfif"
    },
    {
        "company": "Various Clients",
        "link": "",
        "position": "Full Stack Web Developer",
        "duration": "Summer 2022",
        "type": "Paid",
        "description": [
            "Custom web development and design for clients using MongoDB, Express, and Node, utilizing MongoDB, Express, Node.JS, and Bootstrap."
        ],
        "logo": ""
    }
]